/*******************************************************************************************************
编程题＃1: 对象返回值
总时间限制: 1000ms 内存限制: 65536kB 
描述
填空，按要求输出 

0
5
*******************************************************************************************************/

#include <iostream>
using namespace std;

class A {
public:
    int val;
// 在此处补充你的代码
    A(int n = 0) { val = n; }
    A& GetObj() {
        return *this;
    }
// 在此处补充你的代码
};

int main() {
    A a;
    cout << a.val << endl;
    a.GetObj() = 5;
    cout << a.val << endl;
    return 0;
}